{
  "introduction": {
    "title": "Introduction",
    "sections": [
      {
        "content": "Indigo Regen is a regenerative agriculture management tool that helps farmers and land managers make informed decisions about soil health, carbon sequestration, and sustainable farming practices through comprehensive data analysis."
      },
      {
        "subheading": "Our Vision",
        "content": ["We've expanded the traditional concept of agriculture into a complete regenerative ecosystem that encourages farmers to view their land as living spaces requiring continuous care and cultivation. Just as ancient agricultural systems created sustainable microcosms of productivity and biodiversity, modern regenerative farming serves as curated spaces for environmental restoration and discovery.",
    "Indigo Regen provides analysis tools that work at every scale—from your entire farm down to individual plots—while also supporting project management and sustainability reporting across multiple channels."]
      },
      { 
        "subheading": "Key Terms",
        "content": [
          "<strong>Project:</strong> A filtered list of land management activities. You build projects on the 'Plan' screen by selecting your farm and land type, then applying additional filters to generate your targeted activity list. Manual projects can also be created on the Implement screen by adding activities through data entry or field monitoring.",
          "<strong>Plan:</strong> The screen where you create projects by filtering activities based on your specific criteria.",
          "<strong>Implement:</strong> The page where you work with your projects—either executing activities for soil improvement, carbon capture, or biodiversity enhancement, or generating sustainability reports for certification and stakeholder communication.",
          "<strong>Portfolio:</strong> Where your projects are stored, these are further grouped by category - 'planning', 'active', 'monitoring' and 'complete'"
        ]
      },
      {
        "subheading": "Getting Started",
        "content": "Begin by navigating to the Portfolio screen to view previously saved work or to Plan screen to create your first project, then once your project is saved, move to Implement to put your regenerative practices to work. If you need inspiration, start with an overview of your land on the Analyze screen."
      }
    ]
  },
  "analyze": {
    "title": "Analyze",
    "sections": [
      {
        "subheading": "Farm Selection",
        "content": [
          "The Analyse screen allows you to visualize a subset of your farm using a variety of charts and statistics.",
          "You can select a farm and a land type using the dropdowns at the top of the screen. The current number of available and active projects is displayed beneath the selection panel.",
          "Selections are remembered between sessions, and default settings are loaded automatically unless overridden."
        ],
        "media": {
          "src": "/media/farm-selector.png",
          "title": "Farm / Land Type Selector",
          "type": "image"
        }
      },
      {
        "subheading": "Chart Data Categories",
        "content": [
          "Chart data is generated based on your selected farm and land type. Metrics are grouped and displayed in a series of chart panels. These include:",
          "<strong>Farm</strong> – Distribution of projects among farms",
          "<strong>Land Type</strong> – Distribution of projects among different land types",
          "<strong>Status</strong> – Shows ACTIVE, COMPLETED, ON HOLD, and CANCELLED project totals",
          "<strong>Age</strong> – Categorizes projects based on age (years since initiation)",
          "<strong>Activity Level</strong> – Categorizes projects by intensity of activities",
          "<strong>Outcome</strong> – Groups projects based on total carbon sequestered or other outcomes",
          "You can switch between viewing total projects, total outcomes, total area, or calculated metrics such as average outcome per project or area per outcome."
        ],
         "media": {
          "src": "/media/chart-data.png",
          "title": "Chart Data",
          "type": "image"
        }
      },
      {
        "subheading": "Viewing Chart Data",
        "content": [
          "Each chart panel includes toggles to control which project statuses are included in the data:",
          "Active",
          "Completed",
          "On Hold",
          "Cancelled",
          "Charts are interactive—tapping or clicking on a chart segment reveals a tooltip with detailed statistics, including project count, area, outcome, and date ranges.",
          "You can also toggle individual categories on or off via the legend, allowing you to focus on specific parts of your farm."
        ],
         "media": {
          "src": "/media/chart-displays.png",
          "title": "Chart Displays",
          "type": "image"
        }
      },
      {
         "subheading": "Chart Types",
        "content": [
          "The following chart types are available for each category:",
          "Pie Chart – Visualizes the share of categories (e.g. land types, project ages)",
          "Bar Chart – Displays project count or outcomes as horizontal bars",
          "Stacked Chart – Stacked bar chart showing included and excluded projects",
          "Scatter Plot – Plots category outcomes against total project count",
          "Gantt (Activity) – Shows category durations based on project age or activity level",
          "Outcomes Bar Chart – Sorts categories by outcome volume for comparison",
          "Use the chart view toggle to switch between these options. Tooltips and axis labels will update accordingly."
        ],
        "media": {
          "src": "/media/analyze-demo.mov",
          "title": "Analyze",
          "type": "video"
        }
      }
    ]
  },
  "cultivate": {
    "title": "Cultivate",
    "sections": [
      {
        "content": "The cultivate screen offers the same visualisation functionality as the Analyze screen but adds filtering and subsetting tools to identify and save a \"project\" — a subset of land management activities from the selected farm based on specified criteria."
      },
      {
        "subheading": "Farm Selection",
        "content": "These controls work the same as on the Analyze page. Select a farm and/or land type to filter and analyze a specific group. You can also select grouped land types if configured."
      },
      {
        "subheading": "Filter Mode",
        "content": "Use the following panels to select a mode and configure filters specific to the chosen type. Each mode supports different search parameters."
      },
      {
        "subheading": "Soil Health Improvement",
        "content": [
          "Select a soil health improvement type and use the slider to define a threshold. The following filter types are supported:",
          "<strong>High Carbon</strong> – Projects with more than X tons of carbon sequestered.",
          "<strong>Low pH</strong> – Projects targeting soil acidification with lime or other amendments.",
          "<strong>Nutrient Deficient</strong> – Projects aimed at correcting nutrient imbalances.",
          "Statistics such as soil health metrics, project duration, and outcome distributions are displayed to assist in selecting appropriate thresholds."
        ]
      },
      {
        "subheading": "Find",
        "content": [
          "Search for projects based on their status and activity level:",
          "<strong>Active</strong> – Projects currently being implemented.",
          "<strong>On Hold</strong> – Projects temporarily paused.",
          "<strong>Cancelled</strong> – Projects that were cancelled before completion.",
          "Use the activity level slider to specify the minimum intensity of activities. You can select multiple statuses at once."
        ]
      },
      {
        "subheading": "Transfer",
        "content": [
          "Set three filter sliders to define a complex query:",
          "Projects older than X years",
          "Projects with more than Y tons of carbon sequestered",
          "Projects not active in the last Z months",
          "Only projects meeting all three criteria will be included in results."
        ]
      },
      {
        "subheading": "Charts",
        "content": "Chart data for the selected filter is displayed similarly to the Analyze screen. You can toggle the Show Excluded option to view results both with and without non-matching projects. Charts may include category breakdowns, land type groupings, and financial statistics such as cost per ton of carbon sequestered."
      },
      {
        "subheading": "Results",
        "content": "Projects matching the cultivation search are listed in the results panel. You can save these projects, which will appear in the Implement screen. Each project can be reviewed, exported, or deleted as needed.",
        "media": {
          "src": "/media/cultivate-demo.mov",
          "title": "Cultivate",
          "type": "video"
        }
      }
    ]
  },
  "implement": {
    "title": "Implement",
    "sections": [
      {
        "content": "Use the Implement screen to manage existing projects."
      },
      {
        "subheading": "Header",
        "content": "The Implement screen allows you to view and refine a selected project. Projects may be viewed as a list, gallery, or via charts, and refined through filters, selection tools, and sublists."
      },
      {
        "subheading": "Metadata Lookup",
        "content": "Use Metadata Lookup to fetch project metadata from external databases. If a match is found, the project's details will be auto-filled."
      },
      {
        "subheading": "Filter",
        "content": "Use filter to search within the current project by activity type, status, or outcome. Results update in real-time and can help you isolate activities for adjustment or reporting."
      },
      {
        "subheading": "Display",
        "content": [
          "Projects can be visualized in several modes:",
          "<strong>Charts</strong> – Includes tabs for Activity (implementation trends), Distribution (status breakdown), and Outcomes (volume per category).",
          "<strong>List</strong> – Shows project metadata, activity details, and status (Active, On Hold, Cancelled). Items can be selected or edited directly from the list.",
          "<strong>Gallery</strong> – Displays project-related images or documents in a responsive grid. Each item includes quick-access actions to update status or open the detail view.",
          "You can toggle between views using the mode selector at the top of the screen."
        ]
      },
      {
        "subheading": "Create Subproject",
        "content": [
          "To generate a subproject:",
          "1. Select activities using checkboxes or tap Select All.",
          "2. Tap Generate Subproject.",
          "3. Enter a name for the new project.",
          "The new project will be saved locally and become immediately available for review."
        ],
        "media": {
          "src": "/media/implement-demo.mov",
          "title": "Implement",
          "type": "video"
        }
      },
      {
        "subheading": "Manual Activity Entry",
        "content": [
          "After creating a project, additional activities can be added manually:",
          "1. Select the target farm and land type",
          "2. Enter activity details and expected outcomes",
          "3. Save activities to add them to the project",
          "Manual entries can be used to specify custom or one-time activities not covered by standard practices."
        ],
        "media": {
          "src": "/media/manual-demo.mov",
          "title": "Manual Activity Entry",
          "type": "video"
        }
      },
      {
        "subheading": "Scanner",
        "content": [
          "To add activities via barcode:",
          "1. Tap the Scanner button",
          "2. Scan one or more barcodes",
          "3. Review matched activities",
          "4. Tap Approve to add them to the current project",
          "Scanned items are matched by project ID where possible and may fetch data from external databases."
        ]
      },
      {
        "subheading": "Generate Report",
        "content": [
          "You can generate a report for a project in two ways:",
          "<strong>Standard Report</strong> – Generates a report with default settings and content.",
          "<strong>Custom Report</strong> – Allows selection of specific data, charts, and layout options.",
          "Reports can be previewed, saved as PDF, or printed directly from the app."
        ]
      }
    ]
  },
  "portfolio": {
    "title": "Portfolio",
    "sections": [
      {
        "content": "Use the Portfolio screen to manage and organize your collections of projects."
      },
      {
        "subheading": "Projects",
        "content": "Projects for the selected portfolio are grouped and displayed by source. Each group can be expanded to view the contained projects. Tap a project to access additional actions such as rename, export, share, or delete."
      },
      {
        "subheading": "Export Project",
        "content": "Tap a project, then choose \"Export\" to preview and export it in .txt, .csv, or .html format."
      },
      {
        "subheading": "Create Manual Project",
        "content": "Tap \"Create Manual Project\" to begin a new empty project. You'll be redirected to the Implement screen where you can add activities via manual entry or scanner."
      },
      {
        "subheading": "Share Project",
        "content": "Tap a project, then choose \"Share\" to move or copy it to another portfolio. You can select the target portfolio and choose the mode (copy or move)."
      },
      {
        "subheading": "Rename Project",
        "content": "Tap a project, then choose \"Rename\" to update its name. You'll be prompted to enter the new project name."
      },
      {
        "subheading": "Rename Portfolio",
        "content": "Tap the pencil icon in the header to rename the current portfolio. Edits apply immediately after confirmation."
      },
      {
        "subheading": "Change Portfolio",
        "content": "Tap \"Change\" to select a different portfolio from the list or create a new one."
      },
      {
        "subheading": "Create Portfolio",
        "content": "From the portfolio selection menu, tap \"Create New Portfolio\" to start a new collection. You'll be prompted for a name and optional password protection."
      },
      {
        "subheading": "Delete Portfolio",
        "content": "If not protected, portfolios can be deleted via the action menu. Protected portfolios require password confirmation before deletion.",
        "media": {
          "src": "/videos/portfolio-demo.mov",
          "title": "Portfolios",
          "type": "video"
        }
      }
    ]
  },
  "support": {
    "title": "Contact Us",
    "sections": [
      {
        "content": "If you're experiencing any issues or have questions about the app, please reach out to our support team."
      },
      {
        "content": "• Email: <a href=\"mailto:support@indigoregen.com.au\" style=\"color: #646cff; text-decoration: underline;\">support@indigoregen.com.au</a>"
      },
      {
        "content": "We typically respond within 24-48 hours during business days."
      }
    ]
  }
}
